Revit 2026 API

# CommandMenuItemSetAvailabilityClassName Method

---

Set availabilityClassName of CommandMenuItem

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetAvailabilityClassName(
	string availabilityClassName
)
```
```vb
Public Sub SetAvailabilityClassName (
	availabilityClassName As String
)
```
```cpp
public:
void SetAvailabilityClassName(
	String^ availabilityClassName
)
```
```fsharp
member SetAvailabilityClassName :
        availabilityClassName : string -> unit
```

#### Parameters

availabilityClassName String

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The availability class name is the class which implements IExternalCommandAvailability interface.

#### Reference

CommandMenuItem Class

Autodesk.Revit.UI Namespace